[
    {
      "authorName": "Jordan Carroll",
      "rating": 5,
      "text": "I worked with Capital M for my DN visa in Colombia. It was a difficult process, not because of Capital M, but with changes in the government and specific documentation needed for my individual case. I was incredibly impressed with the timeliness of Capital M in getting things done, staying on top of the process, and ultimately, after many different submissions, we finally made it happen and I was approved based on their persistance and guidance. I am so grateful for their patience in helping me get my visa. They also never charged me for all the additional work they did that was seemingly out of scope. They are great people.",
      "reviewDate": "5 weeks ago",
      "url": "https://maps.app.goo.gl/Pmrb2y8e77prHAUq7"
    },
    {
      "authorName": "Marcela Saracay",
      "rating": 5,
      "text": "I highly recommend Capital Law for anyone in need of visa services. They made the process feel straightforward and manageable. From our first meeting, Capital Law was professional, knowledgeable, and approachable. They took the time to explain each step and answered all of my questions promptly. Thanks to their expertise and guidance, the visa applications for our company were successful!",
      "reviewDate": "a month ago",
      "url": "https://maps.app.goo.gl/KKhTWKX5FsG26KJV8"
    },
    {
      "authorName": "John Smith",
      "rating": 5,
      "text": "Simply amazing! Incredibly knowledgeable, professional, and effective. Daniel (excellent English) and his talented, hardworking team picked up the ball last minute from two prior legal services (one popular one which gave bad/incorrect advice, the other who didn't respond w/the urgency my case needed), and delivered the right visa solution for me. I am ecstatic. He was on top of everything, including facilitating a salvaconducto and subsequent  processing. I am amazed at their efficiency and accuracy, as well as their affordability. Choose them for your Colombian visa needs!",
      "reviewDate": "2 months ago",
      "url": "https://maps.app.goo.gl/5dCNgzbRBr77xfbC9"
    },
    {
      "authorName": "David King",
      "rating": 5,
      "text": "I’m a retired engineer from the US who for several reasons, choose Colombia as my retirement destination. The Retirement Visa requirements are straightforward, but there’s a great deal of detail and timelines to be met.\nDaniel Luque and Capital M Law tracked everything keeping me informed with timely email and a continuously upreviewDated spreadsheet in the most professional and respectful manner. They directed me to their many resources and contacts on how and where to gather the documents I needed, including translation and apostille services. AND communication was in English, since I haven’t learned Spanish yet. Capital M Law was a pleasure to work with.\nI started the process in the US about three months before arriving in Colombia and completed in about three months after that. My application was rejected the first time so we met and Capital M Law proposed a solution. We reapplied and it was approved the second time.\nThe fee Capital M Law charged was very reasonable.\nI couldn’t imagine doing this without a top-notch law team like Capital M Law.\nDavid",
      "reviewDate": "2 months ago",
      "url": "https://maps.app.goo.gl/ZC5oEZGiPvDsjT6L8"
    },
    {
      "authorName": "Dineth Randunu",
      "rating": 5,
      "text": "It has been a great experience to work with Daniel and the team to obtain the DN Visa. My visa was approved in about a week.",
      "reviewDate": "2 months ago",
      "url": "https://maps.app.goo.gl/bSiBebZY6vKzLE629"
    },
    {
      "authorName": "Raymond Jones",
      "rating": 5,
      "text": "Amazing lawyer who simplified my entire visa process and made it 100x easier. Also speaks English well",
      "reviewDate": "5 months ago",
      "url": "https://maps.app.goo.gl/YcYR8j6i41wkq9zk7"
    },
    {
      "authorName": "Samuel Salter",
      "rating": 5,
      "text": "I have been using Daniel as my immigration attorney in Colombia  for around 15 months. Before him I worked with two other lawyers. They were ok but Daniel is great. The difference between good and great is huge. I highly recommend him. I found him through a recommendation posted in a medellin expat group. I was having issues with my visa application at the time. I hope someone who was in my same position reads this post and like me will call Daniel. Trust me you will be on your first step towards making your visa troubles go away. 😊",
      "reviewDate": "5 months ago",
      "url": "https://maps.app.goo.gl/cetDiUn5Zha6hnwAA"
    },
    {
      "authorName": "Ganna Briginets",
      "rating": 5,
      "text": "Great service. Did my Nomad visa with them, everything was covered perfectly and the service fee was decent. Daniel explained me all the details and pointed to some of my documents that I provided incorrectly and needed to fix. Got my visa for 1 year in 2 weeks smoothly without any hassle.",
      "reviewDate": "5 months ago",
      "url": "https://maps.app.goo.gl/F6r7j6n6amjd8fVq7"
    },
    {
      "authorName": "Dave Watt",
      "rating": 5,
      "text": "Daniel and his team have two times now provided me with fantastic service to obtain my cedula extranjero.  The fee was modest but some of the best money ever spent here in Colombia. They are organized and have a streamlined process that makes everything go smoothly--including a good recommendation for the health insurance requirement. Equally important is that the communication is excellent.  They are quick to respond with concerning any issue or question about getting the needed documents.  I highly recommend you hire Capital M. for any Visa or citizenship issue you have.",
      "reviewDate": "7 months ago",
      "url": "https://maps.app.goo.gl/5XFtcjSrEbYt7zcPA"
    },
    {
      "authorName": "Evan Zolc",
      "rating": 5,
      "text": "Capital Law was amazing and very helpful. They were very responsive and fast. They worked with me and did things in a timely matter. I would and will use them again any chance I can get. I cant recommend them more.",
      "reviewDate": "7 months ago",
      "url": "https://maps.app.goo.gl/4DrJjNi9P2vyzfMy8"
    },
    {
      "authorName": "Lyna Seridji",
      "rating": 5,
      "text": "I highly recommend Daniel Luque and his company for anyone needing assistance with the digital nomad visa process. Everything was handled quickly and efficiently, and the explanations provided were very clear. A great experience overall!",
      "reviewDate": "7 months ago",
      "url": "https://maps.app.goo.gl/KKVT9XuvQRGLfKJ69"
    },
    {
      "authorName": "Steve Templeton",
      "rating": 5,
      "text": "very helpful getting my Resident Visa.  Highly recommend",
      "reviewDate": "7 months ago",
      "url": "https://maps.app.goo.gl/W2xGNfHwD1V6QEBh8"
    },
    {
      "authorName": "Leonie Gisin",
      "rating": 5,
      "text": "Smooth process. Very professional. Communication is 5 stars. Highly recommend!",
      "reviewDate": "7 months ago",
      "url": "https://maps.app.goo.gl/3AEHwARJgGR6AWVc9"
    },
    {
      "authorName": "Judith C.",
      "rating": 5,
      "text": "Excellent legal counsel.  I could not be more satisfied with the services of Capital M and Daniel Luque. While my case was complicated and others were skeptical about the outcome,  Daniel made sure all supporting documents had been collected and verified before presenting my immigration case and within 10 days I got notice of the approval .",
      "reviewDate": "7 months ago",
      "url": "https://maps.app.goo.gl/9xX8LLSA98Kfn93PA"
    },
    {
      "authorName": "Kenneth Litteral",
      "rating": 5,
      "text": "To whom it may concern,\nI highly recommend Capital M Law for its exceptional legal services. From start to finish, the professionalism, expertise, and dedication was outstanding. With attention to detail, a well-planned strategic approach, and clear lines of communication, Capital M Law helped me to achieved the outcome I was hoping for. If you need legal representation, choose Capital M Law for a seamless and successful experience.\nSincerely,\nA Very Happy Digital Nomad 😁",
      "reviewDate": "8 months ago",
      "url": "https://maps.app.goo.gl/5WGzc8u6W9af39zF8"
    },
    {
      "authorName": "Rodje Malcolm",
      "rating": 5,
      "text": "I highly recommend Daniel and the Capital M team. This was the snoothest visa process I have been through. They give excellent advice and are very clieng-focused.\n\nI have used other services in the past that felt very cold and distant. With Capital M, I felt very well attended to.",
      "reviewDate": "9 months ago",
      "url": "https://maps.app.goo.gl/1A3FCSuk3Bb2HZLp8"
    },
    {
      "authorName": "Ashley Fontaine",
      "rating": 5,
      "text": "Daniel helped me with my DN visa, and he was so organized and on top of everything I needed to do. He gave me a checklist, they texted my materials before I submitted, and when anything confusing came up he was always available. There were some extra steps for someone who is self-employed that I hadn't anticipated - I really appreciate his promptness in responding, and his communication by email and WhatsApp so I can refer back to materials as I need to. He even scheduled my immigration appointment to get my ID card when new appointments were finally added after the new year (and going like hotcakes!). I highly recommend Daniel if you need someone to help you with your visa process.",
      "reviewDate": "9 months ago",
      "url": "https://maps.app.goo.gl/LMn4sWRh76XBRKvD6"
    },
    {
      "authorName": "William Taylor",
      "rating": 5,
      "text": "Capital M Law es una firma de abogados profesionalmente competente.  Estoy muy contento con su servicio..",
      "reviewDate": "10 months ago",
      "url": "https://maps.app.goo.gl/nfUtJQJNwUBSyneJ8"
    },
    {
      "authorName": "Tyler Honigsfeld",
      "rating": 5,
      "text": "Really loved working with Michael. He was attentive throughout my entire visa process, and I would recommend him and his firm for all of your needs.",
      "reviewDate": "10 months ago",
      "url": "https://maps.app.goo.gl/BqcXGVnuaYPuEiKE8"
    },
    {
      "authorName": "Armen Petrosian",
      "rating": 5,
      "text": "Amazing experience! Very knowledgeable and always eager to help. I highly recommend!",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/Mtwf5GYLK76FZFFw9"
    },
    {
      "authorName": "Myah Pacheco",
      "rating": 5,
      "text": "I was so impressed by the services of Daniel and Capital M. My visa process turned out to be quite complex, and Daniel provided excellent guidance and assistance every step of the way. I cannot recommend this service enough. If you need a fantastic lawyer, look no further!",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/8Y7eX8Kn3TrSTeto7"
    },
    {
      "authorName": "Leaf Lefraug",
      "rating": 5,
      "text": "Highly recommend Daniel! He helped our family with a digital nomad visa which had a few complications due to being self employed and a few other things. He was with us through the process and helped us obtain our visas. Since we are still learning Spanish he would let us call him when needed and would translate if we were at the immigration office or notary. He later helped us with the purchase of a property which had a challenging seller but he really helped with them and even while he was out of town since he knew the deal was time sensitive! He speaks great English and is very reasonably priced. We’ll definitely use Daniel when we re-apply for our visas or for anything else.",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/UsEqc7NDUeWWvDTm6"
    },
    {
      "authorName": "Wilma",
      "rating": 5,
      "text": "Estoy increíblemente feliz por Daniel y Capital M que me ayudaron en el proceso de visa. Increíblemente profesional y de gran ayuda. Puedo recomendar ellos y voy a volver a utilizar a Daniel.",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/GtjHC1uFTJQoZEcE7"
    },
    {
      "authorName": "Stef Solferini",
      "rating": 5,
      "text": "Daniel and the team did a great job. Highly recommend them for helping you with your visa processing!",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/Now4oTj2ccjLdgyb6"
    },
    {
      "authorName": "Luz Mery Maya Jaramillo",
      "rating": 5,
      "text": "DOCTOR Daniel y Doctora Maria Fernánda\nMuchas gracias por su colaboracion y compromiso con su trabajo\nSon realmente muy profesionales.",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/djVckCe3VHXHcTp19"
    },
    {
      "authorName": "Marc Farrell",
      "rating": 5,
      "text": "I cannot say enough glowing in positive things about Dan's expertise and his staff. They were professional, they get things done immediately. I got my Visa and sedula like magic. He is the best speaks English in Spanish in highly recommend.",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/QHZ4bf89bSbAsgYj8"
    },
    {
      "authorName": "K.S. Eide (ID)",
      "rating": 5,
      "text": "You will not find a better resource in Colombia for immigration or business legal.  Daniel is super efficient, cordial, bilingual, and more importantly… he is honest and trustworthy.",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/8VxB1MYwMHFsTPyi8"
    },
    {
      "authorName": "Cory Mescon",
      "rating": 5,
      "text": "Attorney Luque at Capital M was patient, kind, and professional in getting digital nomad/beneficiary visas for my family.  He also assisted us with our cédula applications and answered my many questions. He is bilingual and very responsive. I highly recommend his services!",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/iTg2N9PqNHfvdzDE8"
    },
    {
      "authorName": "Alex Klim",
      "rating": 4,
      "text": "Visa received in due time, Daniel was available, supportive and professional.",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/6pEBkEL1VG4yHY8J8"
    },
    {
      "authorName": "marlon david arcila larrea",
      "rating": 5,
      "text": "Es una firma excelente por su atención integral, desde la empatía y en pro del desarrollo empresarial y cuidado de las personas.",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/CiAb27ZEtRcttmDm6"
    },
    {
      "authorName": "Kimberland Jackson",
      "rating": 5,
      "text": "Daniel was extremely knowledgeable and patient with me through my visa process.  I had a few special circumstances but he got me to the finish line.  I am so grateful to have had someone to help me with this process.  He made it much less stressful.  I definitely would recommend that you use his services. Muchas gracias Daniel!! 🙏🏾",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/PVHEc1b5yQx1jUjx9"
    },
    {
      "authorName": "Christopher A. John",
      "rating": 5,
      "text": "I worked with Daniel for help on my digital nomad visa. He was very quick to respond to messages and was very helpful in the whole process. He was also very affordable compared to some other lawyers I researched.\n\nIn addition, he provided ongoing help and assistance as I transitioned over to Colombia. His English was easy to understand and I always felt very at home talking with Daniel.\n\nIf you require any services that Daniel is offering, I would make sure to utilize him. He came highly referred and now I see why. I would hire him again for anything I have going on period!",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/zKBCUZZBa6bpnXeK6"
    },
    {
      "authorName": "zac zacharia",
      "rating": 5,
      "text": "Capital M Abogados where very professional and made my visa application very simple and easy and stood by me all the way. I cant recommend them enough the best legal team and also really amazing people",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/PPUnUWFVkjV4bFfo6"
    },
    {
      "authorName": "M Rpo",
      "rating": 5,
      "text": "Excellent service. Do yourselves a favor and use capital M when navigating legal questions in Colombia. They helped me with investment as a foreign citizen. Answered my multiple questions in a timely manger, for an excellent rate and even followed up beyond what can be expected in North America. Daniel was very thorough and easy to talk to. He breaks down legal concepts in simple notions with actual examples. Feels like  dealing with a friend, more than a lawyer. They're my go to firm whenever I need to get legal advice in Colombia.",
      "reviewDate": "1 year ago",
      "url": "https://maps.app.goo.gl/ag1bDZ96fdwjnwvw7"
    }
  ]